In [1]:
import pandas as pd

In [7]:
#Creating a dictionary
data = {'Name':['Jai','Princi','Gaurav','Anuj'],
       'Age':[27,24,22,26],
       'Address':['Delhi','Kanpur','Allahabad','Kannauj'],
       'Qualifications':['Msc','MA','MCA','Phd'] 
       }
data

{'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
 'Age': [27, 24, 22, 26],
 'Address': ['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
 'Qualifications': ['Msc', 'MA', 'MCA', 'Phd']}

In [8]:
type(data)

dict

In [9]:
#Convert the dict into Dataframe
df = pd.DataFrame(data)
df

     Name  Age    Address Qualifications
0     Jai   27      Delhi            Msc
1  Princi   24     Kanpur             MA
2  Gaurav   22  Allahabad            MCA
3    Anuj   26    Kannauj            Phd

In [10]:
#datatype of df
type(df)

pandas.core.frame.DataFrame

In [11]:
#select two columns
df[['Name','Qualifications']]

     Name Qualifications
0     Jai            Msc
1  Princi             MA
2  Gaurav            MCA
3    Anuj            Phd

In [18]:
#printing second to fourth columns and every rows
df[df.columns[1:4]]

   Age    Address Qualifications
0   27      Delhi            Msc
1   24     Kanpur             MA
2   22  Allahabad            MCA
3   26    Kannauj            Phd

In [21]:
#select 3 rows and two columns
#loc will send to its location and illoc will send to. its integer location
df.loc[1:6,['Name','Address']]

     Name    Address
1  Princi     Kanpur
2  Gaurav  Allahabad
3    Anuj    Kannauj

In [22]:
#slicing operator-printing 2 rows and name to address column
df.loc[0:1, 'Name':'Address']

     Name  Age Address
0     Jai   27   Delhi
1  Princi   24  Kanpur

In [23]:
#displayiing all the details of 0th row 
#: means every column
df.loc[0, :]

Name                Jai
Age                  27
Address           Delhi
Qualifications      Msc
Name: 0, dtype: object

In [24]:
#displaying every row and columns from 0 to 2 so only 0th and 1st column will bve printed
df.iloc[:, 0:2]

     Name  Age
0     Jai   27
1  Princi   24
2  Gaurav   22
3    Anuj   26

In [25]:
#giving slicing to both rows and columns
df.iloc[0:2, 1:3]

   Age Address
0   27   Delhi
1   24  Kanpur

In [26]:
#Creating a dictionary
data = {'Name':['Jai','Princi','Gaurav','Anuj','Aangi'],
       'Age':[27,24,22,26,20],
       'Address':['Delhi','Kanpur','Allahabad','Kannauj','Ahmedabad'],
       'Qualifications':['Msc','Msc','Bsc','Msc','Bsc'] 
       }
data

{'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj', 'Aangi'],
 'Age': [27, 24, 22, 26, 20],
 'Address': ['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Ahmedabad'],
 'Qualifications': ['Msc', 'Msc', 'Bsc', 'Msc', 'Bsc']}

In [27]:
df = pd.DataFrame(data)
df

     Name  Age    Address Qualifications
0     Jai   27      Delhi            Msc
1  Princi   24     Kanpur            Msc
2  Gaurav   22  Allahabad            Bsc
3    Anuj   26    Kannauj            Msc
4   Aangi   20  Ahmedabad            Bsc

In [28]:
#checking the condition and creating new column
data['Salary'] = [150000 if x== 'Msc' else 50000 for x in data ['Qualifications']]
df = pd.DataFrame(data)
df

     Name  Age    Address Qualifications  Salary
0     Jai   27      Delhi            Msc  150000
1  Princi   24     Kanpur            Msc  150000
2  Gaurav   22  Allahabad            Bsc   50000
3    Anuj   26    Kannauj            Msc  150000
4   Aangi   20  Ahmedabad            Bsc   50000

In [31]:
#updating in salary columns
data['Salary'] = [250000 if x>25  else 50000 for x in data ['Age']]
df = pd.DataFrame(data)
df

     Name  Age    Address Qualifications  Salary
0     Jai   27      Delhi            Msc  250000
1  Princi   24     Kanpur            Msc   50000
2  Gaurav   22  Allahabad            Bsc   50000
3    Anuj   26    Kannauj            Msc  250000
4   Aangi   20  Ahmedabad            Bsc   50000

In [32]:
#adding status column
data['Status'] = ['Advanced COder' if x>=250000 else 'Beginners' for x in data ['Salary']]
df = pd.DataFrame(data)
df

     Name  Age    Address Qualifications  Salary          Status
0     Jai   27      Delhi            Msc  250000  Advanced COder
1  Princi   24     Kanpur            Msc   50000       Beginners
2  Gaurav   22  Allahabad            Bsc   50000       Beginners
3    Anuj   26    Kannauj            Msc  250000  Advanced COder
4   Aangi   20  Ahmedabad            Bsc   50000       Beginners

In [33]:
#it will give series of data
df = pd.Series(data)
df

Name                             [Jai, Princi, Gaurav, Anuj, Aangi]
Age                                            [27, 24, 22, 26, 20]
Address              [Delhi, Kanpur, Allahabad, Kannauj, Ahmedabad]
Qualifications                            [Msc, Msc, Bsc, Msc, Bsc]
Salary                        [250000, 50000, 50000, 250000, 50000]
Status            [Advanced COder, Beginners, Beginners, Advance...
dtype: object

In [34]:
data['Salary']

[250000, 50000, 50000, 250000, 50000]

In [35]:
pd.Series([2, 4, 6])

0    2
1    4
2    6
dtype: int64

In [42]:
df['disc']= df['Salary']*.10

TypeError: can't multiply sequence by non-int of type 'float'

In [47]:
df.to_csv('mydata')

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.